title: PowerShell Download and Executed Cradle
id: 8b9c0d1e-2345-6789-01ab-cdef23456789
status: experimental
description: detection for PowerShell download and Execution cradles with various Invoke-Expression
 techniques pattern where PowerShell is used to fetch and immediately execute remote code or file
author: Manar Mamdouh
date: 2025/10/30
references:
  - https://www.picussecurity.com/resource/blog/cavalry-werewolf-apt
logsource:
    category: process_creation
    product: windows
detection:
      powershell_process:
        Image|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
            - '\cmd.exe'
      download_indicators:
        CommandLine|contains:
            - 'Invoke-WebRequest'
            - 'curl'
            - 'wget'
            - 'WebClient''
            - '.DownloadString('
            - '.DownloadFile('
            - 'System.Net.WebClient'
            - 'Start-BitsTransfer'
      iex_patterns:
        CommandLine|contain:
            - 'IEX'
            - 'I`E`X'
            - 'I`EX'
            - 'IE`X'
            - 'iex'
            - 'Invoke-Expression'
            - 'Invoke''Expression'
            - 'Invoke-Expr'
condition: powershell_process and (iex_patterns or download_indicators)
level: high
tags:
    - attack.t1105
    - attack.execution
    - attack.t1059.001
    - attack.t1027
