title: Suspicious Email Attachments with Fake Official or Urgent Lures
id: 2f31a9d5-8b23-4c5f-9b2b-bb2d12e41f23
status: experimental
description: Detects emails containing attachments with filenames suggesting urgency or official nature
  (e.g., "urgent", "invoice", "salary") combined with executable or macro-enabled file types  often used 
  in phishing and malware delivery campaigns.
author: Manar Mamdouh
date: 2025/10/31
references:
  - https://www.picussecurity.com/resource/blog/cavalry-werewolf-apt
logsource:
  product: office365
  service: exchange
  category: email
detection:
  selection_keywords:
    FileName|contains:
      - 'bonus'
      - 'payout'
      - 'layoff'
      - 'termination'
      - 'urgent'
      - 'immediate'
      - 'confidential'
      - 'invoice'
      - 'salary'
      - 'payment'
      - 'results'
      - 'award'
      - 'audit'
      - 'project'
      - 'official'
      - 'legal'
      - 'subpoena'
      - 'money'
      - 'review'
      - 'transaction'
  selection_extensions:
    FileName|endswith:
      - '.exe'
      - '.scr'
      - '.zip'
      - '.js'
      - '.vbs'
      - '.wsf'
      - '.jar'
      - '.docm'
      - '.xlsm'
      - '.pptm'
  condition: selection_keywords and selection_extensions
falsepositives:
  - Legitimate internal emails using these terms for business purposes
level: high
tags:
  - attack.initial_access
  - attack.t1566.001
